# ЗАДАНИЕ 12.7.3 (HW-03)
# Вам дан словарь per_cent с распределением процентных ставок по вкладам в различных банках таким образом,
# что ключ — название банка, значение — процент. Напишите программу, в результате которой будет сформирован список
# deposit значений — накопленные средства за год вклада в каждом из банков. На вход программы с клавиатуры вводится
# сумма money, которую человек планирует положить под проценты.

money = int(input('Введите сумму: '))
per_cent = {'ТКБ': 5.6, 'СКБ': 5.9, 'ВТБ': 4.28, 'СБЕР': 4.0}
deposit = [int(money / 100 * per_cent.get('ТКБ')), int(money / 100 * per_cent.get('СКБ')),
           int(money / 100 * per_cent.get('ВТБ')), int(money / 100 * per_cent.get('СБЕР'))]
max_profit = max(deposit)
print(deposit)
print('Максимальная сумма, которую вы можете заработать —', max_profit)
